[Killed] BlockStatement
main/pages/Restaurants/RestaurantEditPage.js:9:46
 import { useNavigate } from 'react-router-dom'
 
 
-export default function RestaurantEditPage() {
-    let { id } = useParams();
-
-    let navigate = useNavigate(); 
-
-    const response = restaurantUtils.getById(id);
-
-    const onSubmit = async (restaurant) => {
-        const updatedRestaurant = restaurantUtils.update(restaurant);
-        console.log("updatedRestaurant: " + JSON.stringify(updatedRestaurant));
-        navigate("/restaurants/list");
-    }  
-
-    return (
-        <BasicLayout>
-            <div className="pt-2">
-                <h1>Edit Restaurant</h1>
-                <RestaurantForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={response.restaurant}/>
-            </div>
-        </BasicLayout>
-    )
-}
+export default function RestaurantEditPage() {}
killedBy: RestaurantEditPage tests renders without crashing
statusReason: Error: RestaurantEditPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/pages/Restaurants/RestaurantEditPage.js:16:44
 
     const response = restaurantUtils.getById(id);
 
-    const onSubmit = async (restaurant) => {
-        const updatedRestaurant = restaurantUtils.update(restaurant);
-        console.log("updatedRestaurant: " + JSON.stringify(updatedRestaurant));
-        navigate("/restaurants/list");
-    }  
+    const onSubmit = async (restaurant) => {}  
 
     return (
killedBy: RestaurantEditPage tests redirects to /restaurants/list on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>
