[Killed] StringLiteral
main/pages/Restaurants/RestaurantCreatePage.js:13:14
   const onSubmit = async (restaurant) => {
     const createdRestaurant = restaurantUtils.add(restaurant);
     console.log("createdRestaurant: " + JSON.stringify(createdRestaurant));
-    navigate("/restaurants");
+    navigate("");
   }  
 
killedBy: RestaurantCreatePage tests redirects to /restaurants on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/restaurants"
Received: ""

Number of calls: 1

<html>
