[Killed] StringLiteral
main/pages/Restaurants/RestaurantIndexPage.js:18:21
     const showCell = (cell) => JSON.stringify(cell.row.values);
 
     const deleteCallback = async (cell) => {
-        console.log(`RestaurantIndexPage deleteCallback: ${showCell(cell)})`);
+        console.log(``);
         restaurantUtils.del(cell.row.values.id);
         navigate("/restaurants");
killedBy: RestaurantIndexPage tests delete button calls delete and reloads page
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "RestaurantIndexPage deleteCallback: {\"id\":3,\"name\":\"Freebirds\",\"description\":\"Burrito joint, and iconic Isla Vista location\"}"
Received string:    ""

[Killed] StringLiteral
main/pages/Restaurants/RestaurantIndexPage.js:26:41
     return (
         <BasicLayout>
             <div className="pt-2">
-                <Button style={{ float: "right" }} as={Link} to="/restaurants/create">
+                <Button style={{ float: "" }} as={Link} to="/restaurants/create">
                     Create Restaurant
                 </Button>
killedBy: RestaurantIndexPage tests renders correct fields
statusReason: Error: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null
