[Killed] BlockStatement
main/pages/Hotels/HotelCreatePage.js:6:43
 import { useNavigate } from 'react-router-dom'
 import { hotelUtils } from 'main/utils/hotelUtils';
 
-export default function HotelCreatePage() {
-
-  let navigate = useNavigate(); 
-
-  const onSubmit = async (hotel) => {
-    const createdHotel = hotelUtils.add(hotel);
-    console.log("createdHotel: " + JSON.stringify(createdHotel));
-    navigate("/hotels");
-  }  
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Create New Hotel</h1>
-        <HotelForm submitAction={onSubmit} />
-      </div>
-    </BasicLayout>
-  )
-}
+export default function HotelCreatePage() {}
 
killedBy: HotelCreatePage tests renders without crashing
statusReason: Error: HotelCreatePage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/pages/Hotels/HotelCreatePage.js:10:37
 
   let navigate = useNavigate(); 
 
-  const onSubmit = async (hotel) => {
-    const createdHotel = hotelUtils.add(hotel);
-    console.log("createdHotel: " + JSON.stringify(createdHotel));
-    navigate("/hotels");
-  }  
+  const onSubmit = async (hotel) => {}  
 
   return (
killedBy: HotelCreatePage tests redirects to /hotels on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>
