[Killed] BlockStatement
main/pages/Hotels/HotelEditPage.js:9:41
 import { useNavigate } from 'react-router-dom'
 
 
-export default function HotelEditPage() {
-    let { id } = useParams();
-
-    let navigate = useNavigate(); 
-
-    const response = hotelUtils.getById(id);
-
-    const onSubmit = async (hotel) => {
-        const updatedHotel = hotelUtils.update(hotel);
-        console.log("updatedHotel: " + JSON.stringify(updatedHotel));
-        navigate("/hotels");
-    }  
-
-    return (
-        <BasicLayout>
-            <div className="pt-2">
-                <h1>Edit Hotel</h1>
-                <HotelForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={response.hotel}/>
-            </div>
-        </BasicLayout>
-    )
-}
+export default function HotelEditPage() {}
killedBy: HotelEditPage tests renders without crashing
statusReason: Error: HotelEditPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/pages/Hotels/HotelEditPage.js:16:39
 
     const response = hotelUtils.getById(id);
 
-    const onSubmit = async (hotel) => {
-        const updatedHotel = hotelUtils.update(hotel);
-        console.log("updatedHotel: " + JSON.stringify(updatedHotel));
-        navigate("/hotels");
-    }  
+    const onSubmit = async (hotel) => {}  
 
     return (
killedBy: HotelEditPage tests redirects to /hotels on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>
