[Killed] BlockStatement
main/pages/Hotels/HotelIndexPage.js:17:44
 
     const showCell = (cell) => JSON.stringify(cell.row.values);
 
-    const deleteCallback = async (cell) => {
-        console.log(`HotelIndexPage deleteCallback: ${showCell(cell)})`);
-        hotelUtils.del(cell.row.values.id);
-        navigate("/hotels");
-    }
+    const deleteCallback = async (cell) => {}
 
     return (
killedBy: HotelIndexPage tests delete button calls delete and reloads page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0
