[Killed] BlockStatement
src/main/utils/hotelUtils.js:2:19
 // get hotels from local storage
-const get = () => {
-    const hotelValue = localStorage.getItem("hotels");
-    if (hotelValue === undefined) {
-        const hotelCollection = { nextId: 1, hotels: [] }
-        return set(hotelCollection);
-    }
-    const hotelCollection = JSON.parse(hotelValue);
-    if (hotelCollection === null) {
-        const hotelCollection = { nextId: 1, hotels: [] }
-        return set(hotelCollection);
-    }
-    return hotelCollection;
-};
+const get = () => {};
 
 const getById = (id) => {
killedBy: HotelTable tests Delete button calls delete callback
statusReason: TypeError: Cannot read properties of undefined (reading 'hotels')

[Killed] StringLiteral
src/main/utils/hotelUtils.js:3:45
 // get hotels from local storage
 const get = () => {
-    const hotelValue = localStorage.getItem("hotels");
+    const hotelValue = localStorage.getItem("");
     if (hotelValue === undefined) {
         const hotelCollection = { nextId: 1, hotels: [] }
killedBy: hotelUtils tests get When hotels is undefined in local storage, should set to empty list
statusReason: Error: Unexpected key:

[Killed] ConditionalExpression
src/main/utils/hotelUtils.js:4:9
 // get hotels from local storage
 const get = () => {
     const hotelValue = localStorage.getItem("hotels");
-    if (hotelValue === undefined) {
+    if (true) {
         const hotelCollection = { nextId: 1, hotels: [] }
         return set(hotelCollection);
killedBy: hotelUtils tests get When hotels is [] in local storage, should return []
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "hotels", "{\"nextId\":1,\"hotels\":[]}"

[Killed] BlockStatement
src/main/utils/hotelUtils.js:4:35
 // get hotels from local storage
 const get = () => {
     const hotelValue = localStorage.getItem("hotels");
-    if (hotelValue === undefined) {
-        const hotelCollection = { nextId: 1, hotels: [] }
-        return set(hotelCollection);
-    }
+    if (hotelValue === undefined) {}
     const hotelCollection = JSON.parse(hotelValue);
     if (hotelCollection === null) {
killedBy: hotelUtils tests get When hotels is undefined in local storage, should set to empty list
statusReason: SyntaxError: Unexpected token u in JSON at position 0

[Killed] ConditionalExpression
src/main/utils/hotelUtils.js:9:9
         return set(hotelCollection);
     }
     const hotelCollection = JSON.parse(hotelValue);
-    if (hotelCollection === null) {
+    if (false) {
         const hotelCollection = { nextId: 1, hotels: [] }
         return set(hotelCollection);
killedBy: hotelUtils tests get When hotels is null in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"hotels": [], "nextId": 1}
Received: null

[Killed] BlockStatement
src/main/utils/hotelUtils.js:9:35
         return set(hotelCollection);
     }
     const hotelCollection = JSON.parse(hotelValue);
-    if (hotelCollection === null) {
-        const hotelCollection = { nextId: 1, hotels: [] }
-        return set(hotelCollection);
-    }
+    if (hotelCollection === null) {}
     return hotelCollection;
 };
killedBy: hotelUtils tests get When hotels is null in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"hotels": [], "nextId": 1}
Received: null

[Killed] BlockStatement
src/main/utils/hotelUtils.js:16:25
     return hotelCollection;
 };
 
-const getById = (id) => {
-    if (id === undefined) {
-        return { "error": "id is a required parameter" };
-    }
-    const hotelCollection = get();
-    const hotels = hotelCollection.hotels;
-
-    /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = hotels.findIndex((r) => r.id == id);
-    if (index === -1) {
-        return { "error": `hotel with id ${id} not found` };
-    }
-    return { hotel: hotels[index] };
-}
+const getById = (id) => {}
 
 // set hotels in local storage
killedBy: hotelUtils tests getById Check that getting a hotel by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"hotel": {"address": "5650 Calle Real, Goleta, CA 93117", "description": "hotel's rooms feature an eclectic mix of textures and textiles, accented by dashes of nostalgia like mid-mod furnishings.", "id": 3, "name": "The Leta Hotel"}}
Received: undefined

[Killed] ConditionalExpression
src/main/utils/hotelUtils.js:24:43
     const hotels = hotelCollection.hotels;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = hotels.findIndex((r) => r.id == id);
+    const index = hotels.findIndex((r) => true);
     if (index === -1) {
         return { "error": `hotel with id ${id} not found` };
killedBy: hotelUtils tests getById Check that getting a hotel by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Object {
    "hotel": Object {
-     "address": "5650 Calle Real, Goleta, CA 93117",

[Killed] EqualityOperator
src/main/utils/hotelUtils.js:24:43
     const hotels = hotelCollection.hotels;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = hotels.findIndex((r) => r.id == id);
+    const index = hotels.findIndex((r) => r.id != id);
     if (index === -1) {
         return { "error": `hotel with id ${id} not found` };
killedBy: hotelUtils tests getById Check that getting a hotel by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Object {
    "hotel": Object {
-     "address": "5650 Calle Real, Goleta, CA 93117",

[Killed] UnaryOperator
src/main/utils/hotelUtils.js:25:19
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = hotels.findIndex((r) => r.id == id);
-    if (index === -1) {
+    if (index === +1) {
         return { "error": `hotel with id ${id} not found` };
     }
killedBy: hotelUtils tests getById Check that getting a hotel by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

  Object {
-   "hotel": Object {
-     "address": "5650 Calle Real, Goleta, CA 93117",

[Killed] ConditionalExpression
src/main/utils/hotelUtils.js:25:9
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = hotels.findIndex((r) => r.id == id);
-    if (index === -1) {
+    if (false) {
         return { "error": `hotel with id ${id} not found` };
     }
killedBy: hotelUtils tests getById Check that getting a non-existing hotel returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "hotel with id 99 not found",
+   "hotel": undefined,

[Killed] ObjectLiteral
src/main/utils/hotelUtils.js:26:16
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = hotels.findIndex((r) => r.id == id);
     if (index === -1) {
-        return { "error": `hotel with id ${id} not found` };
+        return {};
     }
     return { hotel: hotels[index] };
killedBy: hotelUtils tests getById Check that getting a non-existing hotel returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "error": "hotel with id 99 not found",
- }

[Killed] ObjectLiteral
src/main/utils/hotelUtils.js:28:12
     if (index === -1) {
         return { "error": `hotel with id ${id} not found` };
     }
-    return { hotel: hotels[index] };
+    return {};
 }
 
killedBy: hotelUtils tests getById Check that getting a hotel by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Object {
-   "hotel": Object {
-     "address": "5650 Calle Real, Goleta, CA 93117",

[Killed] StringLiteral
src/main/utils/hotelUtils.js:33:26
 
 // set hotels in local storage
 const set = (hotelCollection) => {
-    localStorage.setItem("hotels", JSON.stringify(hotelCollection));
+    localStorage.setItem("", JSON.stringify(hotelCollection));
     return hotelCollection;
 };
killedBy: hotelUtils tests get When hotels is undefined in local storage, should set to empty list
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "hotels", "{\"nextId\":1,\"hotels\":[]}"
Received: "", "{\"nextId\":1,\"hotels\":[]}"

Number of calls: 1

[Killed] BlockStatement
src/main/utils/hotelUtils.js:48:27
 };
 
 // update a hotel in local storage
-const update = (hotel) => {
-    const hotelCollection = get();
-
-    const hotels = hotelCollection.hotels;
-
-    /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = hotels.findIndex((r) => r.id == hotel.id);
-    if (index === -1) {
-        return { "error": `hotel with id ${hotel.id} not found` };
-    }
-    hotels[index] = hotel;
-    set(hotelCollection);
-    return { hotelCollection: hotelCollection };
-};
+const update = (hotel) => {};
 
 // delete a hotel from local storage
killedBy: hotelUtils tests update Check that updating an existing hotel works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] ConditionalExpression
src/main/utils/hotelUtils.js:54:43
     const hotels = hotelCollection.hotels;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = hotels.findIndex((r) => r.id == hotel.id);
+    const index = hotels.findIndex((r) => true);
     if (index === -1) {
         return { "error": `hotel with id ${hotel.id} not found` };
killedBy: hotelUtils tests update Check that updating an non-existing hotel returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 22

  Object {
-   "error": "hotel with id 99 not found",
+   "hotelCollection": Object {

[Killed] ConditionalExpression
src/main/utils/hotelUtils.js:54:43
     const hotels = hotelCollection.hotels;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = hotels.findIndex((r) => r.id == hotel.id);
+    const index = hotels.findIndex((r) => false);
     if (index === -1) {
         return { "error": `hotel with id ${hotel.id} not found` };
killedBy: hotelUtils tests update Check that updating an existing hotel works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 23
+ Received  +  1

  Object {
-   "hotelCollection": Object {
-     "hotels": Array [

[Killed] ConditionalExpression
src/main/utils/hotelUtils.js:55:9
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = hotels.findIndex((r) => r.id == hotel.id);
-    if (index === -1) {
+    if (true) {
         return { "error": `hotel with id ${hotel.id} not found` };
     }
killedBy: hotelUtils tests update Check that updating an existing hotel works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 23
+ Received  +  1

  Object {
-   "hotelCollection": Object {
-     "hotels": Array [

[Killed] EqualityOperator
src/main/utils/hotelUtils.js:55:9
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = hotels.findIndex((r) => r.id == hotel.id);
-    if (index === -1) {
+    if (index !== -1) {
         return { "error": `hotel with id ${hotel.id} not found` };
     }
killedBy: hotelUtils tests update Check that updating an existing hotel works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 23
+ Received  +  1

  Object {
-   "hotelCollection": Object {
-     "hotels": Array [

[Killed] StringLiteral
src/main/utils/hotelUtils.js:56:27
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = hotels.findIndex((r) => r.id == hotel.id);
     if (index === -1) {
-        return { "error": `hotel with id ${hotel.id} not found` };
+        return { "error": `` };
     }
     hotels[index] = hotel;
killedBy: hotelUtils tests update Check that updating an non-existing hotel returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "hotel with id 99 not found",
+   "error": "",

[Killed] ObjectLiteral
src/main/utils/hotelUtils.js:56:16
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = hotels.findIndex((r) => r.id == hotel.id);
     if (index === -1) {
-        return { "error": `hotel with id ${hotel.id} not found` };
+        return {};
     }
     hotels[index] = hotel;
killedBy: hotelUtils tests update Check that updating an non-existing hotel returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "error": "hotel with id 99 not found",
- }

[Killed] BlockStatement
src/main/utils/hotelUtils.js:64:21
 };
 
 // delete a hotel from local storage
-const del = (id) => {
-    if (id === undefined) {
-        return { "error": "id is a required parameter" };
-    }
-    const hotelCollection = get();
-    const hotels = hotelCollection.hotels;
-
-    /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = hotels.findIndex((r) => r.id == id);
-    if (index === -1) {
-        return { "error": `hotel with id ${id} not found` };
-    }
-    hotels.splice(index, 1);
-    set(hotelCollection);
-    return { hotelCollection: hotelCollection };
-};
+const del = (id) => {};
 
 const hotelUtils = {
killedBy: hotelUtils tests del Check that deleting a hotel by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] ArrowFunction
src/main/utils/hotelUtils.js:72:36
     const hotels = hotelCollection.hotels;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = hotels.findIndex((r) => r.id == id);
+    const index = hotels.findIndex(() => undefined);
     if (index === -1) {
         return { "error": `hotel with id ${id} not found` };
killedBy: hotelUtils tests del Check that deleting a hotel by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 17
+ Received  +  1

  Object {
-   "hotelCollection": Object {
-     "hotels": Array [

[Killed] ConditionalExpression
src/main/utils/hotelUtils.js:72:43
     const hotels = hotelCollection.hotels;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = hotels.findIndex((r) => r.id == id);
+    const index = hotels.findIndex((r) => false);
     if (index === -1) {
         return { "error": `hotel with id ${id} not found` };
killedBy: hotelUtils tests del Check that deleting a hotel by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 17
+ Received  +  1

  Object {
-   "hotelCollection": Object {
-     "hotels": Array [

[Killed] EqualityOperator
src/main/utils/hotelUtils.js:73:9
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = hotels.findIndex((r) => r.id == id);
-    if (index === -1) {
+    if (index !== -1) {
         return { "error": `hotel with id ${id} not found` };
     }
killedBy: hotelUtils tests del Check that deleting a hotel by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 17
+ Received  +  1

  Object {
-   "hotelCollection": Object {
-     "hotels": Array [

[Killed] StringLiteral
src/main/utils/hotelUtils.js:74:27
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = hotels.findIndex((r) => r.id == id);
     if (index === -1) {
-        return { "error": `hotel with id ${id} not found` };
+        return { "error": `` };
     }
     hotels.splice(index, 1);
killedBy: hotelUtils tests del Check that deleting a non-existing hotel returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "hotel with id 99 not found",
+   "error": "",
