[Killed] BlockStatement
main/pages/Movies/MovieCreatePage.js:6:43
 import { useNavigate } from 'react-router-dom'
 import { movieUtils } from 'main/utils/movieUtils';
 
-export default function MovieCreatePage() {
-
-  let navigate = useNavigate(); 
-
-  const onSubmit = async (movie) => {
-    const createdMovie = movieUtils.add(movie);
-    console.log("createdMovie: " + JSON.stringify(createdMovie));
-    navigate("/movies");
-  }  
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Create New Movie</h1>
-        <MovieForm submitAction={onSubmit} />
-      </div>
-    </BasicLayout>
-  )
-}
+export default function MovieCreatePage() {}
 
killedBy: MovieCreatePage tests renders without crashing
statusReason: Error: MovieCreatePage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/pages/Movies/MovieCreatePage.js:10:37
 
   let navigate = useNavigate(); 
 
-  const onSubmit = async (movie) => {
-    const createdMovie = movieUtils.add(movie);
-    console.log("createdMovie: " + JSON.stringify(createdMovie));
-    navigate("/movies");
-  }  
+  const onSubmit = async (movie) => {}  
 
   return (
killedBy: MovieCreatePage tests redirects to /movies on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>
