[Killed] BlockStatement
main/pages/Movies/MovieDetailsPage.js:6:44
 import MovieTable from "main/components/Movies/MovieTable";
 import { movieUtils } from "main/utils/movieUtils";
 
-export default function MovieDetailsPage() {
-  let { id } = useParams();
-
-  const response = movieUtils.getById(id);
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Movie Details</h1>
-        <MovieTable movies={[response.movie]} showButtons={false} />
-      </div>
-    </BasicLayout>
-  )
-}
+export default function MovieDetailsPage() {}
 
killedBy: MovieDetailsPage tests renders without crashing
statusReason: Error: MovieDetailsPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BooleanLiteral
main/pages/Movies/MovieDetailsPage.js:15:60
     <BasicLayout>
       <div className="pt-2">
         <h1>Movie Details</h1>
-        <MovieTable movies={[response.movie]} showButtons={false} />
+        <MovieTable movies={[response.movie]} showButtons={true} />
       </div>
     </BasicLayout>
killedBy: MovieDetailsPage tests loads the correct fields, and no buttons
statusReason: TestingLibraryElementError: Found multiple elements with the text: Delete

Here are the matching elements:

<th
  colspan="1"
  data-testid="MovieTable-header-Delete"
  role="columnheader"
