[Killed] BlockStatement
main/pages/Movies/MovieEditPage.js:9:41
 import { useNavigate } from 'react-router-dom'
 
 
-export default function MovieEditPage() {
-    let { id } = useParams();
-
-    let navigate = useNavigate(); 
-
-    const response = movieUtils.getById(id);
-
-    const onSubmit = async (movie) => {
-        const updatedMovie = movieUtils.update(movie);
-        console.log("updatedMovie: " + JSON.stringify(updatedMovie));
-        navigate("/movies");
-    }  
-
-    return (
-        <BasicLayout>
-            <div className="pt-2">
-                <h1>Edit Movie</h1>
-                <MovieForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={response.movie}/>
-            </div>
-        </BasicLayout>
-    )
-}
+export default function MovieEditPage() {}
killedBy: MovieEditPage tests renders without crashing
statusReason: Error: MovieEditPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/pages/Movies/MovieEditPage.js:16:39
 
     const response = movieUtils.getById(id);
 
-    const onSubmit = async (movie) => {
-        const updatedMovie = movieUtils.update(movie);
-        console.log("updatedMovie: " + JSON.stringify(updatedMovie));
-        navigate("/movies");
-    }  
+    const onSubmit = async (movie) => {}  
 
     return (
killedBy: MovieEditPage tests redirects to /movies on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>
