[Killed] BlockStatement
main/pages/Movies/MovieIndexPage.js:17:44
 
     const showCell = (cell) => JSON.stringify(cell.row.values);
 
-    const deleteCallback = async (cell) => {
-        console.log(`MovieIndexPage deleteCallback: ${showCell(cell)})`);
-        movieUtils.del(cell.row.values.id);
-        navigate("/movies");
-    }
+    const deleteCallback = async (cell) => {}
 
     return (
killedBy: MovieIndexPage tests delete button calls delete and reloads page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] StringLiteral
main/pages/Movies/MovieIndexPage.js:20:18
     const deleteCallback = async (cell) => {
         console.log(`MovieIndexPage deleteCallback: ${showCell(cell)})`);
         movieUtils.del(cell.row.values.id);
-        navigate("/movies");
+        navigate("");
     }
 
killedBy: MovieIndexPage tests delete button calls delete and reloads page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/movies"
Received: ""

Number of calls: 1

<html>
