[Killed] BlockStatement
src/main/utils/movieUtils.js:2:19
 // get movies from local storage
-const get = () => {
-    const movieValue = localStorage.getItem("movies");
-    if (movieValue === undefined) {
-        const movieCollection = { nextId: 1, movies: [] }
-        return set(movieCollection);
-    }
-    const movieCollection = JSON.parse(movieValue);
-    if (movieCollection === null) {
-        const movieCollection = { nextId: 1, movies: [] }
-        return set(movieCollection);
-    }
-    return movieCollection;
-};
+const get = () => {};
 
 const getById = (id) => {
killedBy: MovieTable tests Delete button calls delete callback
statusReason: TypeError: Cannot read properties of undefined (reading 'movies')

[Killed] EqualityOperator
src/main/utils/movieUtils.js:4:9
 // get movies from local storage
 const get = () => {
     const movieValue = localStorage.getItem("movies");
-    if (movieValue === undefined) {
+    if (movieValue !== undefined) {
         const movieCollection = { nextId: 1, movies: [] }
         return set(movieCollection);
killedBy: movieUtils tests get When movies is undefined in local storage, should set to empty list
statusReason: SyntaxError: Unexpected token u in JSON at position 0

[Killed] ConditionalExpression
src/main/utils/movieUtils.js:4:9
 // get movies from local storage
 const get = () => {
     const movieValue = localStorage.getItem("movies");
-    if (movieValue === undefined) {
+    if (false) {
         const movieCollection = { nextId: 1, movies: [] }
         return set(movieCollection);
killedBy: movieUtils tests get When movies is undefined in local storage, should set to empty list
statusReason: SyntaxError: Unexpected token u in JSON at position 0

[Killed] ObjectLiteral
src/main/utils/movieUtils.js:5:33
 const get = () => {
     const movieValue = localStorage.getItem("movies");
     if (movieValue === undefined) {
-        const movieCollection = { nextId: 1, movies: [] }
+        const movieCollection = {}
         return set(movieCollection);
     }
killedBy: movieUtils tests get When movies is undefined in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Object {
-   "movies": Array [],
-   "nextId": 1,

[Killed] ConditionalExpression
src/main/utils/movieUtils.js:9:9
         return set(movieCollection);
     }
     const movieCollection = JSON.parse(movieValue);
-    if (movieCollection === null) {
+    if (false) {
         const movieCollection = { nextId: 1, movies: [] }
         return set(movieCollection);
killedBy: movieUtils tests get When movies is null in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"movies": [], "nextId": 1}
Received: null

[Killed] ConditionalExpression
src/main/utils/movieUtils.js:9:9
         return set(movieCollection);
     }
     const movieCollection = JSON.parse(movieValue);
-    if (movieCollection === null) {
+    if (true) {
         const movieCollection = { nextId: 1, movies: [] }
         return set(movieCollection);
killedBy: movieUtils tests get When movies is [] in local storage, should return []
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "movies", "{\"nextId\":1,\"movies\":[]}"

[Killed] ArrayDeclaration
src/main/utils/movieUtils.js:10:54
     }
     const movieCollection = JSON.parse(movieValue);
     if (movieCollection === null) {
-        const movieCollection = { nextId: 1, movies: [] }
+        const movieCollection = { nextId: 1, movies: ["Stryker was here"] }
         return set(movieCollection);
     }
killedBy: movieUtils tests get When movies is null in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

  Object {
-   "movies": Array [],
+   "movies": Array [

[Killed] ObjectLiteral
src/main/utils/movieUtils.js:10:33
     }
     const movieCollection = JSON.parse(movieValue);
     if (movieCollection === null) {
-        const movieCollection = { nextId: 1, movies: [] }
+        const movieCollection = {}
         return set(movieCollection);
     }
killedBy: MovieTable tests Delete button calls delete callback
statusReason: TypeError: Cannot read properties of undefined (reading 'findIndex')

[Killed] BlockStatement
src/main/utils/movieUtils.js:16:25
     return movieCollection;
 };
 
-const getById = (id) => {
-    if (id === undefined) {
-        return { "error": "id is a required parameter" };
-    }
-    const movieCollection = get();
-    const movies = movieCollection.movies;
-
-    /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = movies.findIndex((r) => r.id == id);
-    if (index === -1) {
-        return { "error": `movie with id ${id} not found` };
-    }
-    return { movie: movies[index] };
-}
+const getById = (id) => {}
 
 // set movies in local storage
killedBy: movieUtils tests getById Check that getting a movie by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"movie": {"id": 3, "name": "High School Musical", "summary": "Basketball player Troy and smart student Gabriella join their school musical", "year": "2006"}}
Received: undefined

[Killed] ConditionalExpression
src/main/utils/movieUtils.js:24:43
     const movies = movieCollection.movies;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = movies.findIndex((r) => r.id == id);
+    const index = movies.findIndex((r) => false);
     if (index === -1) {
         return { "error": `movie with id ${id} not found` };
killedBy: movieUtils tests getById Check that getting a movie by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

  Object {
-   "movie": Object {
-     "id": 3,

[Killed] ConditionalExpression
src/main/utils/movieUtils.js:24:43
     const movies = movieCollection.movies;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = movies.findIndex((r) => r.id == id);
+    const index = movies.findIndex((r) => true);
     if (index === -1) {
         return { "error": `movie with id ${id} not found` };
killedBy: movieUtils tests getById Check that getting a movie by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Object {
    "movie": Object {
-     "id": 3,

[Killed] UnaryOperator
src/main/utils/movieUtils.js:25:19
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = movies.findIndex((r) => r.id == id);
-    if (index === -1) {
+    if (index === +1) {
         return { "error": `movie with id ${id} not found` };
     }
killedBy: movieUtils tests getById Check that getting a movie by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

  Object {
-   "movie": Object {
-     "id": 3,

[Killed] EqualityOperator
src/main/utils/movieUtils.js:25:9
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = movies.findIndex((r) => r.id == id);
-    if (index === -1) {
+    if (index !== -1) {
         return { "error": `movie with id ${id} not found` };
     }
killedBy: movieUtils tests getById Check that getting a movie by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

  Object {
-   "movie": Object {
-     "id": 3,

[Killed] StringLiteral
src/main/utils/movieUtils.js:26:27
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = movies.findIndex((r) => r.id == id);
     if (index === -1) {
-        return { "error": `movie with id ${id} not found` };
+        return { "error": `` };
     }
     return { movie: movies[index] };
killedBy: movieUtils tests getById Check that getting a non-existing movie returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "movie with id 99 not found",
+   "error": "",

[Killed] BlockStatement
src/main/utils/movieUtils.js:32:34
 }
 
 // set movies in local storage
-const set = (movieCollection) => {
-    localStorage.setItem("movies", JSON.stringify(movieCollection));
-    return movieCollection;
-};
+const set = (movieCollection) => {};
 
 // add a movie to local storage
killedBy: movieUtils tests get When movies is undefined in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"movies": [], "nextId": 1}
Received: undefined

[Killed] BlockStatement
src/main/utils/movieUtils.js:38:24
 };
 
 // add a movie to local storage
-const add = (movie) => {
-    const movieCollection = get();
-    movie = { ...movie, id: movieCollection.nextId };
-    movieCollection.nextId++;
-    movieCollection.movies.push(movie);
-    set(movieCollection);
-    return movie;
-};
+const add = (movie) => {};
 
 // update a movie in local storage
killedBy: movieUtils tests add Starting from [], check that adding one movie works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"id": 1, "name": "The Dark Knight", "summary": "Batman tries to protect Gotham from the Joker", "year": "2008"}
Received: undefined

[Killed] ObjectLiteral
src/main/utils/movieUtils.js:40:13
 // add a movie to local storage
 const add = (movie) => {
     const movieCollection = get();
-    movie = { ...movie, id: movieCollection.nextId };
+    movie = {};
     movieCollection.nextId++;
     movieCollection.movies.push(movie);
killedBy: movieUtils tests add Starting from [], check that adding one movie works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

- Object {
-   "id": 1,
-   "name": "The Dark Knight",

[Killed] UpdateOperator
src/main/utils/movieUtils.js:41:5
 const add = (movie) => {
     const movieCollection = get();
     movie = { ...movie, id: movieCollection.nextId };
-    movieCollection.nextId++;
+    movieCollection.nextId--;
     movieCollection.movies.push(movie);
     set(movieCollection);
killedBy: movieUtils tests add Starting from [], check that adding one movie works
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "movies", "{\"nextId\":2,\"movies\":[{\"id\":1,\"name\":\"The Dark Knight\",\"year\":\"2008\",\"summary\":\"Batman tries to protect Gotham from the Joker\"}]}"
Received: "movies", "{\"nextId\":0,\"movies\":[{\"id\":1,\"name\":\"The Dark Knight\",\"year\":\"2008\",\"summary\":\"Batman tries to protect Gotham from the Joker\"}]}"

[Killed] BlockStatement
src/main/utils/movieUtils.js:48:27
 };
 
 // update a movie in local storage
-const update = (movie) => {
-    const movieCollection = get();
-
-    const movies = movieCollection.movies;
-
-    /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = movies.findIndex((r) => r.id == movie.id);
-    if (index === -1) {
-        return { "error": `movie with id ${movie.id} not found` };
-    }
-    movies[index] = movie;
-    set(movieCollection);
-    return { movieCollection: movieCollection };
-};
+const update = (movie) => {};
 
 // delete a movie from local storage
killedBy: movieUtils tests update Check that updating an existing movie works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] EqualityOperator
src/main/utils/movieUtils.js:54:43
     const movies = movieCollection.movies;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = movies.findIndex((r) => r.id == movie.id);
+    const index = movies.findIndex((r) => r.id != movie.id);
     if (index === -1) {
         return { "error": `movie with id ${movie.id} not found` };
killedBy: movieUtils tests update Check that updating an existing movie works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

@@ -1,19 +1,19 @@
  Object {
    "movieCollection": Object {

[Killed] ArrowFunction
src/main/utils/movieUtils.js:54:36
     const movies = movieCollection.movies;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = movies.findIndex((r) => r.id == movie.id);
+    const index = movies.findIndex(() => undefined);
     if (index === -1) {
         return { "error": `movie with id ${movie.id} not found` };
killedBy: movieUtils tests update Check that updating an existing movie works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 23
+ Received  +  1

  Object {
-   "movieCollection": Object {
-     "movies": Array [

[Killed] UnaryOperator
src/main/utils/movieUtils.js:55:19
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = movies.findIndex((r) => r.id == movie.id);
-    if (index === -1) {
+    if (index === +1) {
         return { "error": `movie with id ${movie.id} not found` };
     }
killedBy: movieUtils tests update Check that updating an non-existing movie returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 23

  Object {
-   "error": "movie with id 99 not found",
+   "movieCollection": Object {

[Killed] EqualityOperator
src/main/utils/movieUtils.js:55:9
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = movies.findIndex((r) => r.id == movie.id);
-    if (index === -1) {
+    if (index !== -1) {
         return { "error": `movie with id ${movie.id} not found` };
     }
killedBy: movieUtils tests update Check that updating an existing movie works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 23
+ Received  +  1

  Object {
-   "movieCollection": Object {
-     "movies": Array [

[Killed] BlockStatement
src/main/utils/movieUtils.js:64:21
 };
 
 // delete a movie from local storage
-const del = (id) => {
-    if (id === undefined) {
-        return { "error": "id is a required parameter" };
-    }
-    const movieCollection = get();
-    const movies = movieCollection.movies;
-
-    /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = movies.findIndex((r) => r.id == id);
-    if (index === -1) {
-        return { "error": `movie with id ${id} not found` };
-    }
-    movies.splice(index, 1);
-    set(movieCollection);
-    return { movieCollection: movieCollection };
-};
+const del = (id) => {};
 
 const movieUtils = {
killedBy: movieUtils tests del Check that deleting a movie by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] EqualityOperator
src/main/utils/movieUtils.js:72:43
     const movies = movieCollection.movies;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = movies.findIndex((r) => r.id == id);
+    const index = movies.findIndex((r) => r.id != id);
     if (index === -1) {
         return { "error": `movie with id ${id} not found` };
killedBy: movieUtils tests del Check that deleting a movie by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

@@ -1,13 +1,13 @@
  Object {
    "movieCollection": Object {

[Killed] ArrowFunction
src/main/utils/movieUtils.js:72:36
     const movies = movieCollection.movies;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = movies.findIndex((r) => r.id == id);
+    const index = movies.findIndex(() => undefined);
     if (index === -1) {
         return { "error": `movie with id ${id} not found` };
killedBy: movieUtils tests del Check that deleting a movie by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 17
+ Received  +  1

  Object {
-   "movieCollection": Object {
-     "movies": Array [

[Killed] ConditionalExpression
src/main/utils/movieUtils.js:73:9
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = movies.findIndex((r) => r.id == id);
-    if (index === -1) {
+    if (false) {
         return { "error": `movie with id ${id} not found` };
     }
killedBy: movieUtils tests del Check that deleting a non-existing movie returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 17

  Object {
-   "error": "movie with id 99 not found",
+   "movieCollection": Object {

[Killed] ObjectLiteral
src/main/utils/movieUtils.js:74:16
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = movies.findIndex((r) => r.id == id);
     if (index === -1) {
-        return { "error": `movie with id ${id} not found` };
+        return {};
     }
     movies.splice(index, 1);
killedBy: movieUtils tests del Check that deleting a non-existing movie returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "error": "movie with id 99 not found",
- }
